In [121]:
import pandas as pd

In [168]:
Car_price = pd.read_csv("C:\\Users\\debra\\OneDrive\\Desktop\\PROJECTS FOR DATAANALYSIS\\DATASETS\\Car_price_prediction\\Cars.csv")

In [123]:
Car_price.head(10)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Colour,Seats,No. of Doors,New_Price,Price
0,Mahindra Scorpio,Pune,2012.0,99000.0,Diesel,Manual,Third,12.05 kmpl,2179 CC,120 bhp,Black/Silver,8.0,5.0,NaN,6.00
1,Maruti Baleno,Kochi,2018.0,18678.0,Petrol,Manual,First,21.1 kmpl,998 CC,100 bhp,Others,5.0,4.0,NaN,8.32
2,Mahindra Xylo,Bangalore,2013.0,197000.0,Diesel,Manual,First,11.68 kmpl,2498 CC,112 bhp,White,7.0,5.0,NaN,4.00
3,Hyundai Grand,Delhi,2014.0,45000.0,Diesel,Manual,First,24.0 kmpl,1120 CC,70 bhp,White,5.0,4.0,NaN,3.49
4,Toyota Innova,Delhi,2011.0,65000.0,Diesel,Manual,First,12.8 kmpl,2494 CC,102 bhp,Others,8.0,5.0,NaN,6.40
5,Honda WRV,Kochi,2018.0,15135.0,Petrol,Manual,First,17.5 kmpl,1199 CC,88.7 bhp,White,5.0,4.0,10.57 Lakh,9.29
6,Hyundai Verna,Bangalore,2016.0,79000.0,Diesel,Manual,First,24.8 kmpl,1396 CC,88.7 bhp,White,5.0,4.0,NaN,7.25
7,Toyota Fortuner,Pune,2015.0,36000.0,Diesel,Automatic,First,12.55 kmpl,2982 CC,168.5 bhp,White,7.0,5.0,NaN,22.00
8,Toyota Innova,Hyderabad,2009.0,156056.0,Diesel,Manual,First,12.8 kmpl,2494 CC,102 bhp,Others,8.0,5.0,NaN,8.50
9,Chevrolet Beat,Hyderabad,2012.0,61250.0,Diesel,Manual,First,25.44 kmpl,936 CC,57.6 bhp,Others,5.0,4.0,NaN,2.70

In [124]:
## Finding null or nan values

Car_price.isna().sum()

Name                    0
Location               11
Year                    2
Kilometers_Driven       8
Fuel_Type               0
Transmission           27
Owner_Type             15
Mileage                 2
Engine                 17
Power                  32
Colour                 11
Seats                   5
No. of Doors            1
New_Price            5137
Price                   0
dtype: int64

In [125]:
Car_price.shape

(5961, 15)

In [126]:
# Dropping na value in location 

Car_price=Car_price.dropna(subset=['Location'])
Car_price.shape

(5950, 15)

In [127]:
Car_price=Car_price.dropna(subset=['Year'])
Car_price.shape

(5948, 15)

In [128]:
Car_price=Car_price.dropna(subset=['Transmission'])
Car_price.shape

(5921, 15)

In [129]:
Car_price=Car_price.dropna(subset=['Owner_Type'])
Car_price.shape

(5920, 15)

In [130]:
Car_price=Car_price.dropna(subset=['Mileage'])
Car_price.shape

(5918, 15)

In [131]:
Car_price=Car_price.dropna(subset=['Engine'])
Car_price.shape

(5901, 15)

In [132]:
Car_price=Car_price.dropna(subset=['Power'])
Car_price.shape

(5889, 15)

In [133]:
Car_price=Car_price.dropna(subset=['Colour'])
Car_price.shape

(5889, 15)

In [134]:
Car_price=Car_price.dropna(subset=['Seats'])
Car_price.shape

(5889, 15)

In [135]:
Car_price=Car_price.dropna(subset=['No. of Doors'])
Car_price.shape

(5889, 15)

In [165]:
## the entire operation of dropping na values using for loop

for column in ['Location','Seats','No. of Doors','Colour','Power','Engine','Mileage','Owner_Type',
                         'Transmission','Year']:
    Car_price=Car_price.dropna(subset=[column])
Car_price.shape

(5889, 15)

In [172]:
## drop na func

def dropnacolumn(df, columns):
    for column in columns:
        df=df.dropna(subset=[column])
    return df.shape

In [176]:
dropnacolumn(df=Car_price,columns=['Location','Seats','No. of Doors','Colour','Power','Engine','Mileage','Owner_Type',
                         'Transmission','Year'])

(5889, 15)

In [136]:
## Dropping the New_Price column as it has too many na values

Car_price.drop(columns = 'New_Price', inplace = True)

In [138]:
Car_price.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5889 entries, 0 to 5960
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               5889 non-null   object
 1   Location           5889 non-null   object
 2   Year               5889 non-null   int32
 3   Kilometers_Driven  5889 non-null   float64
 4   Fuel_Type          5889 non-null   object
 5   Transmission       5889 non-null   object
 6   Owner_Type         5889 non-null   object
 7   Mileage            5889 non-null   object
 8   Engine             5889 non-null   object
 9   Power              5889 non-null   object
 10  Colour             5889 non-null   object
 11  Seats              5889 non-null   float64
 12  No. of Doors       5889 non-null   float64
 13  Price              5889 non-null   float64
dtypes: float64(4), int32(1), object(9)
memory usage: 667.1+ KB

In [139]:
Car_price.describe()

              Year  Kilometers_Driven        Seats  No. of Doors        Price
count  5889.000000       5.889000e+03  5889.000000   5889.000000  5889.000000
mean   2013.396162       5.869539e+04     5.270165      4.115639     9.536736
std       3.247458       9.214472e+04     0.790480      0.345843    11.248016
min    1998.000000       1.710000e+02     2.000000      2.000000     0.440000
25%    2012.000000       3.385500e+04     5.000000      4.000000     3.500000
50%    2014.000000       5.300000e+04     5.000000      4.000000     5.660000
75%    2016.000000       7.300000e+04     5.000000      4.000000    10.000000
max    2019.000000       6.500000e+06    10.000000      5.000000   160.000000

In [140]:
Car_price.nunique()

Name                  210
Location               11
Year                   22
Kilometers_Driven    3036
Fuel_Type               4
Transmission            2
Owner_Type              4
Mileage               438
Engine                142
Power                 368
Colour                  3
Seats                   8
No. of Doors            3
Price                1361
dtype: int64

In [141]:
Car_price['Mileage'] = Car_price['Mileage'].str.replace('kmpl|km/kg','',regex=True)

In [142]:
Car_price['Engine'] = Car_price['Engine'].str.replace('CC','')

In [143]:
Car_price['Power'] = Car_price['Power'].str.replace('bhp','')

In [144]:
Car_price['Mileage']=Car_price['Mileage'].astype(float)

In [145]:
Car_price['Engine']=Car_price['Engine'].astype(int)

In [149]:
## Dropping specific rows with 'null ' as a value in thier Power column

Car_price.drop(Car_price[Car_price['Power']== 'null '].index,inplace=True)

In [150]:
Car_price['Power']=Car_price['Power'].astype(float)

In [151]:
Car_price.to_csv(r'C:\\Users\\debra\\OneDrive\\Desktop\\PROJECTS FOR DATAANALYSIS\\DATASETS\\Car_price_prediction\\Car_price_prediction_cleaned.csv',index = False)

In [153]:
Car_price.describe()

,Year,Kilometers_Driven,Mileage,Engine,Power,Seats,No. of Doors,Price
count,5786.000000,5.786000e+03,5786.000000,5786.000000,5786.000000,5786.000000,5786.000000,5786.000000
mean,2013.488593,5.833314e+04,18.278629,1626.677325,113.433716,5.274628,4.118044,9.641153
std,3.163255,9.277115e+04,4.361078,601.763872,53.892306,0.788050,0.342944,11.292628
min,1998.000000,1.710000e+02,0.000000,624.000000,34.200000,2.000000,2.000000,0.440000
25%,2012.000000,3.325675e+04,15.260000,1198.000000,75.235000,5.000000,4.000000,3.550000
50%,2014.000000,5.253450e+04,18.240000,1496.000000,98.590000,5.000000,4.000000,5.750000
75%,2016.000000,7.246800e+04,21.100000,1991.000000,138.100000,5.000000,4.000000,10.110000
max,2019.000000,6.500000e+06,33.540000,5998.000000,560.000000,10.000000,5.000000,160.000000

In [178]:
Car_prices=pd.read_csv("C:\\Users\\debra\\OneDrive\\Desktop\\PROJECTS FOR DATAANALYSIS\\DATASETS\\Car_price_prediction\\Car_price_prediction_cleaned.csv")